app/Controllers/UserController.php

    public function index()
    {
        // A comment Just to trigger git push here
        $model = new UserModel();
        $data['users'] = $model->findAll();
---
SELECT *
FROM `users`

    public function store()
    {
        $model = new UserModel();
        $model->save([
            'name' => $this->request->getPost('name'),
            'email' => $this->request->getPost('email'),
        ]);
---
INSERT INTO `users` (`name`, `email`) VALUES ('sdkdj', 'sldkf@kjldskj')

    public function edit($id)
    {
        $model = new UserModel();
        $data['user'] = $model->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '5'

    public function delete($id)
    {
        $model = new UserModel();
        $model->delete($id);
---
DELETE FROM `users`
WHERE `id` IN ('7')